{"input": "모든 아티스트 정보 조회\n\n이 요청은 데이터베이스에 저장된 모든 아티스트의 전체 정보를 확인하기 위한 것입니다. 아티스트 ID와 이름을 포함한 모든 필드를 조회합니다.\n\n비즈니스 목적:\n- 음악 플랫폼이나 갤러리에서 전체 아티스트 목록 확인\n- 아티스트 관리 시스템에서 등록된 모든 아티스트 정보 검토\n- 새로운 아티스트 추가 전 기존 아티스트 확인\n- 아티스트 데이터베이스의 전반적인 상태 점검\n\n사용자는 아티스트 관련 작업을 시작하기 전에 현재 시스템에 등록된 모든 아티스트를 파악하고자 할 때 이러한 요청을 할 것입니다. 특히 관리자나 데이터 분석가가 아티스트 데이터 전체를 검토하거나 내보내기 위해 사용할 수 있습니다.", "query": "SELECT * FROM Artist"}
{"input": "AC/DC 아티스트가 발매한 모든 앨범 정보\n\n이 쿼리는 특정 아티스트(AC/DC)가 발매한 모든 앨범의 상세 정보를 조회하는 것입니다. 음악 스트리밍 서비스나 음반 판매점에서 특정 아티스트의 전체 디스코그래피를 확인하려는 목적으로 사용됩니다. 사용자가 좋아하는 아티스트의 모든 작품을 한눈에 보거나, 컬렉션을 완성하기 위해 아직 구매하지 않은 앨범을 확인하려는 의도가 있습니다. 또한 음악 플랫폼에서 아티스트 페이지를 구성할 때 해당 아티스트의 모든 앨범을 표시하기 위한 백엔드 쿼리로도 활용될 수 있습니다.", "query": "SELECT * FROM Album WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'AC/DC')"}
{"input": "록 장르에 속하는 모든 음악 트랙 정보\n\n이 요청은 음악 데이터베이스에서 특정 장르에 속하는 모든 트랙을 찾고자 하는 목적이 있습니다. 사용자는 록 음악만 선별적으로 보고 싶어하며, 해당 장르의 모든 트랙 정보(제목, 아티스트, 앨범 등)를 한번에 확인하려는 의도가 있습니다. 이는 록 음악 컬렉션을 분석하거나, 록 장르 플레이리스트를 만들거나, 록 음악의 특성을 연구하는 등의 목적으로 사용될 수 있습니다. 또한 음악 스트리밍 서비스나 음반 판매점에서 록 장르 카테고리를 구성하기 위한 기초 데이터로 활용될 수 있습니다.", "query": "SELECT * FROM Track WHERE GenreId = (SELECT GenreId FROM Genre WHERE Name = 'Rock')"}
{"input": "모든 음악 트랙의 총 재생 시간(밀리초 단위)\n\n이 쿼리는 음악 라이브러리나 스트리밍 서비스에서 전체 콘텐츠의 총 재생 시간을 파악하기 위한 목적으로 사용됩니다. 이러한 정보는 서버 용량 계획, 스트리밍 대역폭 예측, 또는 전체 카탈로그의 규모를 평가하는 데 활용될 수 있습니다. 또한 사용자에게 \"우리 서비스의 모든 음악을 연속해서 들으면 얼마나 걸릴까요?\"와 같은 마케팅 정보를 제공하거나, 백업 시간 예측, 데이터 마이그레이션 계획 등 기술적 목적으로도 사용될 수 있습니다.", "query": "SELECT SUM(Milliseconds) FROM Track"}
{"input": "캐나다에 거주하는 모든 고객의 상세 정보\n\n이 쿼리는 캐나다에 거주하는 고객들의 모든 정보를 조회하기 위한 것입니다. 회사가 캐나다 시장에 집중하거나 캐나다 고객을 위한 특별 프로모션을 계획할 때 유용합니다. 또한 캐나다 지역 마케팅 캠페인을 위한 고객 데이터 분석, 캐나다 고객 서비스 품질 평가, 또는 캐나다 시장 확장 전략을 위한 기초 자료로 활용될 수 있습니다. 캐나다 내 고객 분포나 구매 패턴을 파악하여 지역별 맞춤 서비스를 개발하는 데에도 중요한 정보를 제공합니다.", "query": "SELECT * FROM Customer WHERE Country = 'Canada'"}
{"input": "앨범 ID가 5인 트랙의 총 개수\n\n이 쿼리는 특정 앨범(ID 5)에 포함된 모든 트랙의 수를 계산하는 것입니다. 음악 관리 시스템이나 스트리밍 서비스에서 특정 앨범의 규모를 파악하거나, 앨범 상세 페이지에 표시할 트랙 수 정보를 가져오는 데 사용됩니다. 또한 앨범 간 크기 비교, 앨범 완전성 확인, 또는 특정 앨범의 콘텐츠 분석을 위한 기초 데이터로 활용될 수 있습니다. 음반사나 아티스트가 앨범 구성을 검토하거나 사용자에게 앨범 정보를 제공할 때 필요한 기본 통계 정보입니다.", "query": "SELECT COUNT(*) FROM Track WHERE AlbumId = 5"}
{"input": "총 인보이스 수 조회\n\n이 쿼리는 시스템에 등록된 모든 인보이스(거래 기록)의 총 개수를 파악하기 위한 것입니다. 회사의 전체 거래량을 확인하여 비즈니스 규모를 평가하거나, 회계 감사를 위한 기초 데이터로 활용될 수 있습니다. 또한 시스템 성능 평가나 데이터베이스 크기 예측을 위한 기초 정보로도 사용될 수 있으며, 특정 기간 동안의 거래 증가율을 계산하기 위한 기준점으로 활용될 수 있습니다.", "query": "SELECT COUNT(*) FROM Invoice"}
{"input": "300,000밀리초(5분) 이상 재생 시간을 가진 모든 음악 트랙의 전체 정보\n\n이 쿼리의 목적:\n- 긴 재생 시간을 가진 트랙을 식별하여 특정 재생 목록이나 프로그램에 적합한 음악 찾기\n- 스트리밍 서비스에서 더 긴 콘텐츠를 제공하기 위한 트랙 선별\n- 음악 카탈로그 분석을 통해 장시간 트랙의 분포와 특성 파악\n- 사용자에게 더 긴 음악 경험을 제공하기 위한 추천 시스템 구축\n- 특정 장르나 아티스트의 긴 트랙 패턴 분석을 위한 데이터 수집", "query": "SELECT * FROM Track WHERE Milliseconds > 300000"}
{"input": "매출액 기준 상위 5명의 고객 목록\n\n이 요청은 고객별 총 구매액을 계산하여 가장 많은 금액을 지출한 상위 5명의 고객을 식별하기 위한 것입니다. 회사의 VIP 고객을 파악하거나 충성도 높은 고객을 대상으로 한 마케팅 캠페인을 계획하는 데 사용될 수 있습니다. 또한 매출에 가장 큰 기여를 하는 고객층을 분석하여 비즈니스 전략을 수립하거나, 고객 유지 프로그램을 개발하는 데 중요한 인사이트를 제공합니다. 이러한 데이터는 영업팀이 주요 고객 관계를 관리하거나 경영진이 수익 집중도를 평가하는 데 필수적입니다.", "query": "SELECT CustomerId, SUM(Total) AS TotalPurchase FROM Invoice GROUP BY CustomerId ORDER BY TotalPurchase DESC LIMIT 5"}
{"input": "직원 수 조회\n\n이 쿼리는 회사의 전체 직원 수를 파악하기 위한 것입니다. 인사 관리, 조직 규모 파악, 인력 계획 수립, 예산 책정, 성과 보고서 작성 등에 활용됩니다. 특히 경영진이 회사 전체 인력 현황을 빠르게 파악하거나, 인사팀이 채용 계획을 세울 때, 또는 부서별 인원 배치를 검토할 때 필요한 기본 정보를 제공합니다. 또한 시간에 따른 직원 수 변화를 모니터링하여 회사 성장이나 구조조정 효과를 측정하는 데도 사용될 수 있습니다.", "query": "SELECT COUNT(*) FROM Employee"}
